12/data/attachments/5f893a8836c5958d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael_recent_Friend_48985_6</nif:username>
            <nif:friendToBeRequested>soap_friends_679213f0-1ef1-4869-9c54-b1670eafb22c</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>